FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/cmsis/ARM.CMSIS.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <name>CMSIS</name>
  <description>CMSIS (Cortex Microcontroller Software Interface Standard)</description>
  <vendor>ARM</vendor>
  <!-- <license>CMSIS\CMSIS_END_USER_LICENCE_AGREEMENT.rtf</license> -->
  <url>http://www.keil.com/pack/</url>

  <taxonomy>
    <description Cclass="Board Support">Generic Interfaces for Evaluation and Development Boards</description>
    <description Cclass="CMSIS" doc="CMSIS\Documentation\General\html\index.html">Cortex Microcontroller Software Interface Components</description>
    <description Cclass="Device" doc="CMSIS\Documentation\Core\html\index.html">Startup, System Setup</description>
    <description Cclass="CMSIS Driver" doc="CMSIS\Documentation\Driver\html\index.html">Unified Device Drivers compliant to CMSIS-Driver Specifications</description>
    <description Cclass="File System">File Drive Support and File System</description>
    <description Cclass="Graphics">Graphical User Interface</description>
    <description Cclass="Network">Network Stack using Internet Protocols</description>
    <description Cclass="USB">Universal Serial Bus Stack</description>
  </taxonomy>

  <releases>
    <release version="4.1.0" date="2014-06-12">
      - CMSIS-Driver   2.02  (incompatible update)
      - CMSIS-Pack     1.3   (see revision history for details)
      - CMSIS-DSP      1.4.2 (unchanged)
      - CMSIS-Core     3.30  (unchanged)
      - CMSIS-RTOS RTX 4.74  (unchanged)
      - CMSIS-RTOS API 1.02  (unchanged)
      - CMSIS-SVD      1.10  (unchanged)
      PACK:
      - removed G++ specific files from PACK
      - added Component Startup variant "C Startup"
      - added Pack Checking Utility
      - updated conditions to reflect tool-chain dependency
      - added Taxonomy for Graphics
      - updated Taxonomy for unified drivers from "Drivers" to "CMSIS Drivers"
    </release>
    <release version="4.0.0">
      - CMSIS-Driver   2.00  Preliminary (incompatible update)
      - CMSIS-Pack     1.1   Preliminary
      - CMSIS-DSP      1.4.2 (see revision history for details)
      - CMSIS-Core     3.30  (see revision history for details)
      - CMSIS-RTOS RTX 4.74  (see revision history for details)
      - CMSIS-RTOS API 1.02  (unchanged)
      - CMSIS-SVD      1.10  (unchanged)
    </release>
    <release version="3.20.4">
      - CMSIS-RTOS 4.74 (see revision history for details)
      - PACK Extensions (Boards, Device Features, Flash Programming, Generators, Configuration Wizard). Schema version 1.1.
    </release>
    <release version="3.20.3">
      - CMSIS-Driver API Version 1.10 ARM prefix added (incompatible change)
      - CMSIS-RTOS 4.73 (see revision history for details)
    </release>
    <release version="3.20.2">
      - CMSIS-Pack documentation has been added
      - CMSIS-Drivers header and documentation have been added to PACK
      - CMSIS-CORE, CMSIS-DSP, CMSIS-RTOS API and CMSIS-SVD remain unchanged
    </release>
    <release version="3.20.1">
      - CMSIS-RTOS Keil RTX V4.72 has been added to PACK
      - CMSIS-CORE, CMSIS-DSP, CMSIS-RTOS API and CMSIS-SVD remain unchanged
    </release>
    <release version="3.20.0">
      The software portions that are deployed in the application program are now under a BSD license which allows usage
      of CMSIS components in any commercial or open source projects.  The Pack Description file Arm.CMSIS.pdsc describes the use cases
      The individual components have been update as listed below:
      - CMSIS-CORE adds functions for setting breakpoints, supports the latest GCC Compiler, and contains several corrections.
      - CMSIS-DSP library is optimized for more performance and contains several bug fixes.
      - CMSIS-RTOS API is extended with capabilities for short timeouts, Kernel initialization, and prepared for a C++ interface.
      - CMSIS-SVD is unchanged.
    </release>
  </releases>

  <devices>
    <!-- ******************************  Cortex-M0  ****************************** -->
    <family Dfamily="ARM Cortex M0" Dvendor="ARM:82">
      <device Dname="ARMCM0">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Configurable" Dclock="10000000"/>
        <compile   header="Device\ARM\ARMCM0\Include\ARMCM0.h"/>
        <debug     svd="Device\ARM\SVD\ARMCM0.svd"/>
        <algorithm name="Device\ARM\Flash\NEW_DEVICE.FLM"               start="0x00000000"  size="0x00040000" default="1"/>
        <book      name="Device\ARM\Documents\cortex_m0_dgug.pdf"       title="Cortex-M4 Device Generic Users Guide"/>

        <description>
          The Cortex-M0 processor is an entry-level 32-bit ARM Cortex processor designed
          for a broad range of embedded applications. It offers significant benefits to developers,
          including:
          • simple, easy-to-use programmers model
          • highly efficient ultra-low power operation
          • excellent code density
          • deterministic, high-performance interrupt handling
          • upward compatibility with the rest of the Cortex-M processor family.
        </description>
      </device>
    </family>

    <!-- ******************************  Cortex-M0P  ****************************** -->
    <family Dfamily="ARM Cortex M0 plus" Dvendor="ARM:82">
      <device Dname="ARMCM0P">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Configurable" Dclock="10000000"/>
        <compile   header="Device\ARM\ARMCM0plus\Include\ARMCM0plus.h"/>
        <debug     svd="Device\ARM\SVD\ARMCM0P.svd"/>
        <algorithm name="Device\ARM\Flash\NEW_DEVICE.FLM"               start="0x00000000"  size="0x00040000" default="1"/>
        <book      name="Device\ARM\Documents\cortex_m0p_dgug.pdf"       title="Cortex-M4 Device Generic Users Guide"/>
        <description>
          The Cortex-M0+ processor is an entry-level 32-bit ARM Cortex processor designed
          for a broad range of embedded applications. It offers significant benefits to developers,
          including:
          • simple, easy-to-use programmers model
          • highly efficient ultra-low power operation
          • excellent code density
          • deterministic, high-performance interrupt handling
          • upward compatibility with the rest of the Cortex-M processor family.
        </description>
      </device>
    </family>

    <!-- ******************************  Cortex-M3  ****************************** -->
    <family Dfamily="ARM Cortex M3" Dvendor="ARM:82">
      <device Dname="ARMCM3">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Configurable" Dclock="10000000"/>
        <compile   header="Device\ARM\ARMCM3\Include\ARMCM3.h"/>
        <debug     svd="Device\ARM\SVD\ARMCM3.svd"/>
        <algorithm name="Device\ARM\Flash\NEW_DEVICE.FLM"               start="0x00000000"  size="0x00040000" default="1"/>
        <book      name="Device\ARM\Documents\cortex_m3_dgug.pdf"       title="Cortex-M3 Device Generic Users Guide"/>
        <description>
          The Cortex-M3 processor is an entry-level 32-bit ARM Cortex processor designed
          for a broad range of embedded applications. It offers significant benefits to developers,
          including:
          • simple, easy-to-use programmers model
          • highly efficient ultra-low power operation
          • excellent code density
          • deterministic, high-performance interrupt handling
          • upward compatibility with the rest of the Cortex-M processor family.
        </description>
      </device>
    </family>

    <!-- ******************************  Cortex-M4  ****************************** -->
    <family Dfamily="ARM Cortex M4" Dvendor="ARM:82">
      <device Dname="ARMCM4">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Configurable" Dclock="10000000"/>
        <compile   header="Device\ARM\ARMCM4\Include\ARMCM4.h"/>
        <debug     svd="Device\ARM\SVD\ARMCM4.svd"/>
        <algorithm name="Device\ARM\Flash\NEW_DEVICE.FLM"               start="0x00000000"  size="0x00040000" default="1"/>
        <book      name="Device\ARM\Documents\cortex_m4_dgug.pdf"       title="Cortex-M4 Device Generic Users Guide"/>
        <description>
          The Cortex-M4 processor is an entry-level 32-bit ARM Cortex processor designed
          for a broad range of embedded applications. It offers significant benefits to developers,
          including:
          • simple, easy-to-use programmers model
          • highly efficient ultra-low power operation
          • excellent code density
          • deterministic, high-performance interrupt handling
          • upward compatibility with the rest of the Cortex-M processor family.
        </description>
      </device>
    </family>


    <!-- ******************************  ARMSC000  ****************************** -->
    <family Dfamily="ARM SC000" Dvendor="ARM:82">
      <device Dname="ARMSC000">
        <processor Dcore="SC000" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Configurable" Dclock="10000000"/>
        <compile   header="Device\ARM\ARMSC000\Include\ARMSC000.h"/>
        <debug     svd="Device\ARM\SVD\ARMSC000.svd"/>
        <algorithm name="Device\ARM\Flash\NEW_DEVICE.FLM"               start="0x00000000"  size="0x00040000" default="1"/>
        <description>
          The ARM SC000 processor is an entry-level 32-bit ARM Cortex processor designed
          for a broad range of secure embedded applications. It offers significant benefits to developers,
          including:
          • simple, easy-to-use programmers model
          • highly efficient ultra-low power operation
          • excellent code density
          • deterministic, high-performance interrupt handling
        </description>
      </device>
    </family>


    <!-- ******************************  ARMSC300  ****************************** -->
    <family Dfamily="ARM SC300" Dvendor="ARM:82">
      <device Dname="ARMSC300">
        <processor Dcore="SC300" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Configurable" Dclock="10000000"/>
        <compile   header="Device\ARM\ARMSC300\Include\ARMSC300.h"/>
        <debug     svd="Device\ARM\SVD\ARMSC300.svd"/>
        <algorithm name="Device\ARM\Flash\NEW_DEVICE.FLM"               start="0x00000000"  size="0x00040000" default="1"/>

        <description>
          The ARM SC300 processor is an entry-level 32-bit ARM Cortex processor designed
          for a broad range of secure embedded applications. It offers significant benefits to developers,
          including:
          • simple, easy-to-use programmers model
          • highly efficient ultra-low power operation
          • excellent code density
          • deterministic, high-performance interrupt handling
        </description>
      </device>
    </family>

  </devices>


  <apis>
    <!-- CMSIS-RTOS API -->
    <api Cclass="CMSIS" Cgroup="RTOS" Capiversion="1.0" exclusive="1">
      <description>CMSIS-RTOS API for Cortex-M, SC000, and SC300</description>
      <files>
        <file category="doc" name="CMSIS\Documentation\RTOS\html\index.html"/>
      </files>
    </api>
    <api Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.01" exclusive="0">
        <description>USART Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__usart__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_USART.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01" exclusive="0">
        <description>SPI Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__spi__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_SPI.h" />
        </files>
      </api>
      <api Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02" exclusive="0">
        <description>I2C Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__i2c__interface__gr.html"/>
          <file category="header" name="CMSIS\Driver\Include\Driver_I2C.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="Flash" Capiversion="2.00" exclusive="0">
        <description>Flash Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__flash__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_Flash.h" />
        </files>
      </api>
      <api Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.02" exclusive="0">
        <description>MCI Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__mci__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_MCI.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="NAND" Capiversion="2.01" exclusive="0">
        <description>NAND Flash Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__nand__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_NAND.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.01" exclusive="0">
        <description>Ethernet MAC and PHY Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__eth__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_ETH_MAC.h" />
          <file category="header" name="CMSIS\Driver\Include\Driver_ETH_PHY.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.01" exclusive="0">
        <description>Ethernet MAC Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__eth__mac__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_ETH_MAC.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Capiversion="2.00" exclusive="0">
        <description>Ethernet PHY Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__eth__phy__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_ETH_PHY.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.01" exclusive="0">
        <description>USB Device Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__usbd__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_USBD.h" />
        </files>
      </api>
    <api Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.00" exclusive="0">
        <description>USB Host Driver API for Cortex-M</description>
        <files>
          <file category="doc" name="CMSIS\Documentation\Driver\html\group__usbh__interface__gr.html" />
          <file category="header" name="CMSIS\Driver\Include\Driver_USBH.h" />
        </files>
      </api>
  </apis>

  <!-- conditions are dependency rules that can apply to a component or an individual file -->
  <conditions>
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="Cortex-M Device">
      <description>Cortex-M processor based device: one of CM0, CM0+, CM3, CM4, SC000, SC3000</description>
      <accept Dcore="Cortex-M0"/>
      <accept Dcore="Cortex-M0+"/>
      <accept Dcore="Cortex-M3"/>
      <accept Dcore="Cortex-M4"/>
      <accept Dcore="SC000"/>
      <accept Dcore="SC300"/>
    </condition>

    <condition id="Cortex-M CMSIS Device">
      <description>ARM Cortex-M device</description>
      <require condition="Cortex-M Device"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

