FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/cmsis/ARM.CMSIS.pdsc
    <!-- CMSIS-Startup components -->
    <!-- Cortex-M0 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="ARMCM0 CMSIS">
      <description>System and Startup for Generic ARM Cortex-M0 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM0\Include\ARMCM0.h"/>
        <!-- startup file -->
        <!-- for ARMCC -->
        <file category="source"       name="Device\ARM\ARMCM0\Source\ARM\startup_ARMCM0.s" version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM0\Source\GCC\startup_ARMCM0.S" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM0\Source\GCC\gcc_arm.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM0\Source\system_ARMCM0.c"      version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup"   Cversion="1.0.1" condition="ARMCM0 CMSIS GCC">
      <description>System and Startup for Generic ARM Cortex-M0 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM0\Include\ARMCM0.h"/>
        <!-- startup file -->
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM0\Source\GCC\startup_ARMCM0.c" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM0\Source\GCC\gcc_arm.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM0\Source\system_ARMCM0.c"      version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Cortex-M0+ -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="ARMCM0+ CMSIS">
      <description>System and Startup for Generic ARM Cortex-M0+ device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM0plus\Include\ARMCM0plus.h"/>
        <!-- startup file -->
        <!-- for ARMCC -->
        <file category="source"       name="Device\ARM\ARMCM0plus\Source\ARM\startup_ARMCM0plus.s" version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM0plus\Source\GCC\startup_ARMCM0plus.S" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM0plus\Source\GCC\gcc_arm.ld"           version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM0plus\Source\system_ARMCM0plus.c"      version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup"   Cversion="1.0.1" condition="ARMCM0+ CMSIS GCC">
      <description>System and Startup for Generic ARM Cortex-M0+ device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM0plus\Include\ARMCM0plus.h"/>
        <!-- startup file -->
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM0plus\Source\GCC\startup_ARMCM0plus.c" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM0plus\Source\GCC\gcc_arm.ld"           version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM0plus\Source\system_ARMCM0plus.c"      version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Cortex-M3 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="ARMCM3 CMSIS">
      <description>System and Startup for Generic ARM Cortex-M3 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM3\Include\ARMCM3.h"/>
        <!-- startup file -->
        <!-- for ARMCC -->
        <file category="source"       name="Device\ARM\ARMCM3\Source\ARM\startup_ARMCM3.s" version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM3\Source\GCC\startup_ARMCM3.S" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM3\Source\GCC\gcc_arm.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM3\Source\system_ARMCM3.c"      version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup"   Cversion="1.0.1" condition="ARMCM3 CMSIS GCC">
      <description>System and Startup for Generic ARM Cortex-M3 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM3\Include\ARMCM3.h"/>
        <!-- startup file -->
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM3\Source\GCC\startup_ARMCM3.c" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM3\Source\GCC\gcc_arm.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM3\Source\system_ARMCM3.c"      version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Cortex-M4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="ARMCM4 CMSIS">
      <description>System and Startup for Generic ARM Cortex-M4 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM4\Include\ARMCM4.h"/>
        <!-- startup file -->
        <!-- for ARMCC -->
        <file category="source"       name="Device\ARM\ARMCM4\Source\ARM\startup_ARMCM4.s" version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM4\Source\GCC\startup_ARMCM4.S" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM4\Source\GCC\gcc_arm.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM4\Source\system_ARMCM4.c"      version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup"   Cversion="1.0.1" condition="ARMCM4 CMSIS GCC">
      <description>System and Startup for Generic ARM Cortex-M4 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMCM4\Include\ARMCM4.h"/>
        <!-- startup file -->
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMCM4\Source\GCC\startup_ARMCM4.c" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMCM4\Source\GCC\gcc_arm.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMCM4\Source\system_ARMCM4.c"      version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Cortex-SC000 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="ARMSC000 CMSIS">
      <description>System and Startup for Generic ARM SC000 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMSC000\Include\ARMSC000.h"/>
        <!-- startup file -->
        <!-- for ARMCC -->
        <file category="source"       name="Device\ARM\ARMSC000\Source\ARM\startup_ARMSC000.s" version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMSC000\Source\GCC\startup_ARMSC000.S" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMSC000\Source\GCC\gcc_arm.ld"         version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMSC000\Source\system_ARMSC000.c"      version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup"   Cversion="1.0.1" condition="ARMSC000 CMSIS GCC">
      <description>System and Startup for Generic ARM SC000 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMSC000\Include\ARMSC000.h"/>
        <!-- startup file -->
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMSC000\Source\GCC\startup_ARMSC000.c" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMSC000\Source\GCC\gcc_arm.ld"         version="1.0.0" attr="config" condition="GCC"/>
       <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMSC000\Source\system_ARMSC000.c"      version="1.0.0" attr="config"/>
      </files>
    </component>

    <!-- Cortex-SC300 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="ARMSC300 CMSIS">
      <description>System and Startup for Generic ARM SC300 device</description>
      <files>
        <!--  device header file -->
        <file category="header"       name="Device\ARM\ARMSC300\Include\ARMSC300.h"/>
        <!-- startup file -->
        <!-- for ARMCC -->
        <file category="source"       name="Device\ARM\ARMSC300\Source\ARM\startup_ARMSC300.s" version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- for GCC -->
        <file category="source"       name="Device\ARM\ARMSC300\Source\GCC\startup_ARMSC300.S" version="1.0.0" attr="config" condition="GCC"/>
        <file category="doc" name="Device\ARM\ARMSC300\Source\GCC\gcc_arm.ld"         version="1.0.0" attr="config" condition="GCC"/>
        <!-- system file (system header not specified, as the path is already set by device header) -->
        <file category="source"       name="Device\ARM\ARMSC300\Source\system_ARMSC300.c"      version="1.0.0" attr="config"/>
      </files>
    </component>
